package com.example.user.bcs_guideline.ExamPart;

public class Level2Question {

    public String questions[] = {
            "আনুষ্ঠানিকভাবে স্বাধীনতার ঘোষণাপত্র কবে জারি করা হয়?",
            "ঢাকা বিভাগে কয়টি জেলা আছে?",
            "নিউট্রন আবিষ্কার করেন-",
            " বাংলাদেশ কোন সালে ইসলামী সম্মেলন সংস্থার সদস্য পদ লাভ করে?",
            "হেলসিংকি কোন দেশের রাজধানী?",
            "x+y=12 এবং x-y=2 হলে xy এর মান কত?",
            "সুইডেনের মুদ্রার নাম কী?",
            "জীবাশ্ম জ্বালানি দহনের ফলে বায়ুমণ্ডলে যে গ্রীন হাউজ গ্যাসের পরিমাণ সবচেয়ে বেশি বৃদ্ধি পাচ্ছে-",
            "কাঁচ তৈরির প্রধান কাঁচামাল হলো",
            "He has paid the penalty __ his crimes __ five years in prison.",
            "কোন বানানটি শুদ্ধ?",
            "বাংলাদেশের চীনামাটির সন্ধান পাওয়া গিয়াছে -",
            "বাংলাদেশের বৃহত্তম হাওড়-",
            "কোন মাধ্যম শব্দের গতি সবচেয়ে কম?",
            "১, ২, ৩, ৫, ৮, ১৩, ২১, ৩৪, ... ধারাটির পরবর্তী সংখ্যা কত?",
            "জীবের বংশগতির বৈশিষ্ট্য বহন করে-"

    };

    public String choices[][] = {
            {"১০ এপ্রিল, ১৯৭১", "৭ এপ্রিল, ১৯৭১", " ৭ মার্চ, ১৯৭১", " ২৫ মার্চ, ১৯৭১"},
            {"১৫ টি", "১৭ টি", "১৪ টি", "১২ টি"},
            {"কিউরী", "রাদারফোর্ড", "চ্যাডউইক", "থমসন"},
            {"১৯৭২", "১৯৭৩", "১৯৭৪", "১৯৭৫"},
            {"ফিনল্যান্ড","আয়ারল্যান্ড","রাশিয়া","হল্যান্ড"},
            {"35","140","70","144"},
            {"পাউন্ড","ডলার","ক্রোনা","পিসো"},
            {"জ্বালানিবাস্প","ক্লোরফ্লোর কার্বন","কার্বনডাই অক্সাইড","মিথেন"},
            {"শাজিমাটি","চুনাপাথর","জিপসাম","বালি"},
            {"for, with","at, by","about, at","after, in"},
            {"পাষাণ","পাষান","পাসান","পাশান"},
            {"রানীগঞ্জে","বিজয়পুরে","টেকেরহাটে","বাগালীবাজারে"},
            {"পাথরচাওলি","হাইল","চলন বিল","হাকালুকি"},
            {"তরল পদার্থে","বায়বীয় পদার্থে","কঠিন পদার্থে","শূণ্যতায়"},
            {"৫৫","৪০","৬৮","৮৯"},
            {"নিউক্লিয়াস","নিউক্লিওলাস","ক্রোমোসোম","নিওক্লিওপ্লাজম"}
    };

    public String correctAnswer[] = {
            " ১০ এপ্রিল, ১৯৭১",
            "১৭ টি",
            "চ্যাডউইক",
            "১৯৭৪",
            "35",
            "িনল্যান্ড",
            "ক্রোনা",
            "ার্বনডাই অক্সাইড",
            "বালি",
            "for, with",
            "পাষাণ",
            "বিজয়পুরে",
            "হাকালুকি",
            "বায়বীয় পদার্থে",
            "৫৫",
            "ক্রোমোসোম"
    };

    public String getQuestion(int a){
        String question = questions[a];
        return question;
    }

    public String getchoice1(int a){
        String choice = choices[a][0];
        return choice;
    }

    public String getchoice2(int a){
        String choice = choices[a][1];
        return choice;
    }

    public String getchoice3(int a){
        String choice = choices[a][2];
        return choice;
    }

    public String getchoice4(int a){
        String choice = choices[a][3];
        return choice;
    }

    public String getCorrectAnswer(int a){
        String answer = correctAnswer[a];
        return answer;
    }
}

