package com.example.user.bcs_guideline.ExamPart;

public class Level4Question {
    public String questions[] = {
            "শব্দের তীব্রতা নির্ণায়ক যন্ত্র-",
            "নাইট্রোজেন গ্যাস থেকে কোন সার প্রস্তুত করা হয়-.",
            "Adult cell ক্লোন করে যে ভেড়ার জন্ম হয়েছে তার নাম দেয়া হয়েছে-",
            "নিউমোনিয়া রোগে আক্রন্ত হয় মানব দেহের-",
            "হাড় ও দাঁত কে মজবুত করে-",
            "He has been ill - Friday last.",
            "রবীন্দ্রনাথ ঠাকুরের ছদ্মনাম কি?",
            "‘আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি’র রচিয়তা -  ",
            "কোন জারক রস পাকস্থলীতে দুদ্ধ জমাট বাধায়?",
            "মানুষের ক্রোমোজোমের সংখ্যা কত?",
            "বিশ্বখ্যাত মোনালিসা চিত্রটির চিত্রকর কে?",
            "কোন দেশটি আরব দেশের অর্ন্তভুক্ত নয়?",
            "‘Dog day’ means-",
            "‘বঙ্গদর্শন’ পত্রিকা কোন সালে প্রথম প্রকাশিত হয়?",
            "“সুশিক্ষিত লোক মাত্রই স্বশিক্ষিত”-এই উক্তিটি কার?",
            "রবীন্দ্রনাথ ঠাকুর তাঁর রচিত কোন নাটকটি কাজী নজরুল ইসলাম কে উৎসর্গ করেছিলেন?",
            "১ বর্গ ইঞ্চি কত বর্গ সে:মি সমান?",
            "Are you doing anything special --- the week-end?",
            "‘দ্যুলোক’ শব্দের যথার্থ সন্ধি বিচ্ছেদ কোনটি?",
            "বাংলাদেশের পানি সম্পদের চাহিদা সবচেয়ে বেশি কোন খাতে?",
            "তেঁতুলিয়া কোন জেলায় অবস্থিত?",
            "বাংলাদেশ ও মায়ানমার কে বিভক্তকারী নদী কোনটি?",
            "আকাবা কোন দেশের সমুদ্র বন্দর?",
            "বিশ্বের কোন শহর ‘নিষিদ্ধ শহর’ নামে পরিচিত?",
            "a=1,b=-1,c=2,d=-2 হলে a-(-b)-(-c)-(-d) এর মান কত?",
            "What is the meaning of the expression ‘bottom line’?",
            "১৯৯৬ অলিম্পিক গেমস কোথায় অনুষ্ঠিত হয়?",
            "আল্ট্রাসনোগ্রাফী কী?",


    };

    public String choices[][] = {
            {"অডিও মিটার", "অ্যামিটার", "অডিও ফোন", "অলটিমিটার"},
            {"টিএসপি", "সবুজ সার", "পটাস", "ইউরিয়া"},
            {"শেলী", "ডলি", "মলি", "নেলী"},
            {"ফুসফুস", "যকৃত", "কিডনি", "প্লীহা"},
            {"আয়োডিন","আয়রন","ম্যাগনেসিয়াম","ফসফরাস"},
            {"from","on","in","since"},
            {"ভানুসিংহ","টেকচাঁদ ঠাকুর","বনফুল","মুকুন্দরাম"},
            {"শামসুর রহমান","আলতাফ মাহমুদ","হাসান হাফিজুর রহমান","আবদুল গাফফার চৌধুরী"},
            {"পেপসিন","এমাইলেজ","ট্রিপসিন","রেনিন"},
            {"২৫ জোড়া","২৬ জোড়া","২৩ জোড়া","২৪ জোড়া"},
            {"মাইকেল এঞ্জেলো","লিওনার্দো দ্যা ভিঞ্চি","পাবলো পিকাশো","ভ্যাণগগ"},
            {"জর্ডান","লেবানন","ইরান","বাহরাইন"},
            {"a period of being carefree","a period of habing youthful flings","a period of misfortunate","hot weather"},
            {"১৮৬৫","১৮৭২","১৯৭৫","১৯৮১"},
            {"রবীন্দ্রনাথ ঠাকুর","কাজী আব্দুল ওদুদ","মোহাম্মদ লুৎফর রহমান","প্রমথ চেীধুরী"},
            {"বিসর্জন","ডাকঘর","বসন্ত","অচলায়তন"},
            {"০.০৯২৯","৭.৩২","৬.৪৫","৬৪.৫০"},
            {"in","for","on","at"},
            {"দুঃ+লোক","দিব্+লোক","দ্বি+লোক","দি+লোক"},
            {"আবাসিক","কৃষি","পরিবহন","শিল্প"},
            {"দিনাজপুর","পঞ্চগড়","জয়পুরহাট","লালমনিরহাট"},
            {"কর্ণফুলী","হালদা","সাংগু","নাফ"},
            {"মায়ানমার","জর্ডান","ইরাক","ইসরাইল"},
            {"লাসা","উলানবাহতার","পিয়ংইয়ং","কাবুল"},
            {"0","1","2","3"},
            {"The final step","The end of a road","The last line of a book","The essential point"},
            {"লসএঞ্জেলস","আটলান্টা","টোকিও","নিউ দিল্লী"},
            {"নতুন ধরনের এক্সরে","ছোট তরঙ্গদৈর্ঘ্যের শব্দের দ্বারা ইমেজিং","শরীরের অভ্যন্তরের শব্দ বিশ্লেষণ","শক্তিশালী শব্দ দিয়ে পিত্তা পাথর বিচূর্ণকরণ"},
    };

    public String correctAnswer[] = {
            "অডিও মিটার",
            "ইউরিয়া",
            "ডলি",
            "ফুসফুস",
            "ফসফরাস",
            "since",
            "ভানুসিংহ",
            "আবদুল গাফফার চৌধুরী",
            "রেনিন",
            "২৩ জোড়া",
            "লিওনার্দো দ্যা ভিঞ্চি",
            "ইরান",
            "hot weather",
            "১৮৭২",
            "প্রমথ চেীধুরী",
            "বসন্ত",
            "৬.৪৫",
            "at",
            "দিব্+লোক",
            "কৃষি",
            "পঞ্চগড়",
            "নাফ",
            "জর্ডান",
            "লাসা",
            "0",
            "The essential point",
            "আটলান্টা",
            "ছোট তরঙ্গদৈর্ঘ্যের শব্দের দ্বারা ইমেজিং",

    };

    public String getQuestion(int a){
        String question = questions[a];
        return question;
    }

    public String getchoice1(int a){
        String choice = choices[a][0];
        return choice;
    }

    public String getchoice2(int a){
        String choice = choices[a][1];
        return choice;
    }

    public String getchoice3(int a){
        String choice = choices[a][2];
        return choice;
    }

    public String getchoice4(int a){
        String choice = choices[a][3];
        return choice;
    }

    public String getCorrectAnswer(int a){
        String answer = correctAnswer[a];
        return answer;
    }
}


